{
  "testimonials": [
    {
      "id": 1,
      "reviewer": "Johno Leidig",
      "rating": 5,
      "date": "2 months ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Home",
      "text": "My wife Lauren and I recently had the pleasure of working with Jake to secure our new home, which we move into in just over a week. We've worked with other buyers agents before and the results have been just okay, Jake and his team really operate on another level.\n\nFrom start to finish, the attention to detail, responsiveness, and genuine care for their clients was so clear in everything they did. The whole process felt smooth and stress free, and we couldn't be happier with the outcome.\n\nEdwards and Smith Buyers Agents are the real deal, they're with you for the whole journey from point A to Z and not just A to B. Couldn't recommend them highly enough and will definitely be seeking them out again in the future.",
      "highlights": ["Attention to detail", "Stress-free process", "End-to-end support"]
    },
    {
      "id": 2,
      "reviewer": "Lauren Z",
      "rating": 5,
      "date": "2 months ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Family Home",
      "text": "My husband and I recently purchased our family home with Jake as our buyers agent, and we honestly couldn't have asked for a better experience. From the very beginning, he was incredibly attentive and genuinely listened to what we were looking for. His knowledge of the market has made us feel confident every step of the way, and he always went the extra mile to make the whole process smooth and stress free. Nothing ever felt like too much trouble for him.\n\nIn a market like this, we never thought it would be possible, but Jake helped us secure our home under budget and under market value! We're so grateful for his support and wouldn't hesitate to recommend him to anyone looking to buy.",
      "highlights": ["Under budget", "Under market value", "Market knowledge"]
    },
    {
      "id": 3,
      "reviewer": "Camilla Sjøthun",
      "rating": 5,
      "date": "2 months ago",
      "agent": "Jake Edwards, Kath Mackay",
      "service": "Full Buyers Agent Service",
      "location": "Gold Coast",
      "property_type": "Home",
      "text": "Five-Star Buyer Agent Experience!\n\nWorking with Jake and Kath was an absolute game-changer in our home-buying journey. From our very first meeting, it was clear that we were in the hands of a true professional—someone who not only knows the market inside and out, but also genuinely cares about their clients.\n\nThey took the time to understand exactly what we were looking for, asked all the right questions, and offered expert advice. Their communication was flawless—always responsive, honest, and incredibly organized. They handled every step of the process and it felt entirely stress free.\n\nWe had our perfect home just over a week from our first meeting and even under budget.\n\nWe couldn't be happier and would wholeheartedly recommend them to anyone looking to buy a home. If you want someone who goes above and beyond, this is the buyer agent for you!",
      "highlights": ["Fast turnaround (1 week)", "Under budget", "Kath + Jake collaboration"]
    },
    {
      "id": 4,
      "reviewer": "Ananya P",
      "rating": 5,
      "date": "5 months ago",
      "agent": "Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Home",
      "text": "I went to Edwards & Smith in a bit of a crisis searching for property with tight personal constraints and I was working with Emma to get my purchase through.\n\nI cannot vouch for her enough, her professionalism, and a set of eyes and ears that are more experienced than mine and my partner's, and somehow came up with a result at a lower price point that reflected everything we wanted. Highly communicative and actively did her best to accommodate all of my idiosyncrasies.\n\nEmma is a great listener and really cares about her clients - though I'd never saying for a buyer's agent, but I don't think I've made a better decision during my house purchase journey.\n\nWe are ring fans for a buyer's agent, and honestly I don't think I could have done it without Emma and Edwards and Smith.\n\nCheers everyone.",
      "highlights": ["Lower price", "Great listener", "Accommodating"]
    },
    {
      "id": 5,
      "reviewer": "Savannah Hope",
      "rating": 5,
      "date": "6 months ago",
      "agent": "Dylan Adkins",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Investment Property",
      "text": "Edwards & Smith was highly recommended from the start of my partner and I'd property journey. Jake was our first point of contact and from the beginning, he was efficient, and understanding of our inexperience as first-time buyers. He quickly connected us with Dylan who was with us through every step of the process. We were absolutely thrilled with Dylan. From our first call with Jake to our loan approval, the entire process was simple and all handled with us. We couldn't have asked for a better team.",
      "highlights": ["First-time buyers", "Dylan's expertise", "Simple process"]
    },
    {
      "id": 6,
      "reviewer": "Michael Dunn",
      "rating": 5,
      "date": "2 months ago",
      "agent": "Kath Mackay",
      "service": "Full Buyers Agent Service",
      "location": "Gold Coast",
      "property_type": "First Home",
      "text": "From the first call, Kath made my first experience into buying a property seem less! She was the ultimate professional and was a great communicator throughout the whole process.\n\nFor someone who had no knowledge of realestate or the property market she made it unbelievably easy for me. I would highly recommend her services for someone looking to use a buyers agent to get into the property market.",
      "highlights": ["First-time buyer", "Great communicator", "Made it easy"]
    },
    {
      "id": 7,
      "reviewer": "jessie butts",
      "rating": 5,
      "date": "5 months ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Investment Townhouses",
      "text": "My husband and I were on the hunt for a set of townhouses to add to our investment portfolio. Being based in another state, we anticipated some challenges with researching and purchasing property remotely. That's why we decided to work with Ely, and we couldn't have made a better choice! From the very beginning, Ely impressed us with his professionalism, efficiency, and excellent communication, guiding us through each stage of the process. We were absolutely thrilled when Ely not only found us the perfect investment with just four weeks, but also negotiated an incredible deal that was $50k below the asking price. We highly recommend Ely and the entire team for their dedication and expertise!",
      "highlights": ["Interstate buyer", "$50k below asking", "4 weeks timeline"]
    },
    {
      "id": 8,
      "reviewer": "Jaymee Gilbert",
      "rating": 5,
      "date": "7 months ago",
      "agent": "Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Unknown",
      "text": "We recently had the pleasure of working with Emma on a successful transaction, and I couldn't recommend her highly enough. Throughout the process, she was professional, proactive, and a great communicator, making the entire deal seamless for both the buyer and our seller.\n\nEmma's attention to detail and commitment to finding the right property for her client was evident from start to finish. She negotiated with confidence, ensured everything progressed smoothly, and was a pleasure to deal with. Looking forward to working together again in the future.\n\nHighly recommend Emma to anyone looking for a dedicated and knowledgeable buyer's agent.",
      "highlights": ["Professional", "Proactive", "Confident negotiator"]
    },
    {
      "id": 9,
      "reviewer": "Thomas Dyer",
      "rating": 5,
      "date": "5 months ago",
      "agent": "Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Unknown",
      "text": "The Edward and smith team were an absolute dream.\n\nReally happy with our purchase. We gave them our very specific criteria and budget and they came back with options almost immediately and they carry you through all stages of the buy.\n\nVery refreshing to receive some 5 star customer service. Great people who communicate flawlessly.\n\nSaved time, money and a lot of energy.\n\nSpecial mention to Emma Handley she was amazing.",
      "highlights": ["Specific criteria met", "Fast response", "5-star service"]
    },
    {
      "id": 10,
      "reviewer": "Molly Brown",
      "rating": 5,
      "date": "7 months ago",
      "agent": "Mackenzie",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "First Home",
      "text": "Jake was my first point of contact at Edwards & Smith, and from the start, he was professional, efficient, and incredibly understanding of my inexperience as a first-time buyer. He quickly connected me with Mackenzie, who guided me through every step of the process with patience and expertise. No question was too small—Mackenzie was always available, providing clear answers and reassurance whenever I needed it. From my first call with Jake to my loan approval, the entire process took just over four weeks. I couldn't have asked for a better team to help me secure my first home! Highly recommend 👍",
      "highlights": ["First-time buyer", "4 weeks process", "Patient guidance"]
    },
    {
      "id": 11,
      "reviewer": "Alaina Mills",
      "rating": 5,
      "date": "2 years ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Dream Home",
      "text": "Great experience dealing with Edwards & Smith Buyers Agent.\n\nJake was excellent in communicating and consistently touching base with us in regards to different options available but also took on our feedback if it was not suitable.\n\nDue to his great negotiation skills and persistence we purchased our dream home.\n\nAlso it was not for Jake referring us to a very reputable mortgage broker after a bad experience dealing with another broker during our process we would not have been able to purchase our dream home.\n\nLook no further for a suitable buyers agent. Highly recommended.\n\nWill not disappoint.",
      "highlights": ["Great negotiation", "Mortgage broker referral", "Dream home secured"]
    },
    {
      "id": 12,
      "reviewer": "Trent Nattrass",
      "rating": 5,
      "date": "6 months ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "First Home",
      "text": "Working with Jake to purchase our first home was an absolute pleasure. He guided us through the entire process with ease, making what could have been stressful feel seamless. Thanks to his expertise, we found a home that ticked every box on our brief - and even came in well under budget. We couldn't be happier. You're the man, Jake!",
      "highlights": ["First home", "Under budget", "Seamless process"]
    },
    {
      "id": 13,
      "reviewer": "Nigel Alvares",
      "rating": 5,
      "date": "8 months ago",
      "agent": "Ely Smith, Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Home",
      "text": "Ely & Emma helped us find our new home within budget and considering our time constraints. They are professional, responsive and communicated very well to make the buying process seamless. I would definitely recommend for those wanting to buy a property.",
      "highlights": ["Within budget", "Time constraints met", "Team collaboration"]
    },
    {
      "id": 14,
      "reviewer": "Jamie Barber",
      "rating": 5,
      "date": "5 months ago",
      "agent": "Emma Handley, Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Unknown",
      "text": "Really happy with our experience with E&S. Emma and Ely were great communicators, understood the brief and secured us a property that suits us really well at a decent discount. Will certainly be using them again.",
      "highlights": ["Decent discount", "Great communication", "Understood brief"]
    },
    {
      "id": 15,
      "reviewer": "Caleb Williams",
      "rating": 5,
      "date": "9 months ago",
      "agent": "Jake Edwards, Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Dream Property",
      "text": "Working with Jake and Ely to purchase a property was a very simple and straight forward process. They took all the stress off us and helped keep us calm during the purchasing process. We ended up getting a dream property at a great price and would highly recommend using their services when looking for a home.",
      "highlights": ["Stress-free", "Dream property", "Great price"]
    },
    {
      "id": 16,
      "reviewer": "Paul Armstrong",
      "rating": 5,
      "date": "6 months ago",
      "agent": "Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Home",
      "text": "Emma was a huge asset. She helped me with a better price as well as being my eyes and ears while I was out of town. She made the whole process considerably easier and saved me from several mistakes that a new home buyer might trip over.",
      "highlights": ["Interstate/remote buyer", "Better price", "Avoided mistakes"]
    },
    {
      "id": 17,
      "reviewer": "Shaw Build",
      "rating": 5,
      "date": "10 months ago",
      "agent": "Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "First Home",
      "text": "We worked with Emma to buy our first home and she was incredible! She listened to everything we wanted, took the time to find properties that ticked all of our boxes and never pressured us to make any decisions we weren't 100% on. When it finally came to signing contracts and finalising our purchase, Emma went above and beyond, explained contracts, and made the entire process so seamless. We are so grateful for her help as if it wasn't for Emma we would have never purchased!",
      "highlights": ["First home", "No pressure", "Contract explanation"]
    },
    {
      "id": 18,
      "reviewer": "Kylee Harnisch",
      "rating": 5,
      "date": "4 months ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Unknown",
      "text": "I recently had the pleasure of working with Ely. From start to finish, Ely was an excellent communicator—always prompt, clear, and professional in every interaction & Would happily work with him again anytime!",
      "highlights": ["Excellent communicator", "Professional", "Prompt"]
    },
    {
      "id": 19,
      "reviewer": "Katie Rogers",
      "rating": 5,
      "date": "a year ago",
      "agent": "Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Dream Property",
      "text": "Emma made my first time home buying very stress free and Enjoyable. Emma is very professional, honest, proactive and is exceptional at communication. Emma helped me find the property of by dreams within 3 days. I highly recommend her and her team.",
      "highlights": ["First home", "3 days to find", "Dream property"]
    },
    {
      "id": 20,
      "reviewer": "Jc Maguire",
      "rating": 5,
      "date": "11 months ago",
      "agent": "Ely Smith",
      "service": "Property Evaluation & Negotiation",
      "location": "Cleveland",
      "property_type": "Townhouse",
      "text": "After battling for several months to buy a townhouse I was very weary just trying to negotiate the price and close the sale.\n\nI rang Edwards & Smith who were referred to me by a Real Estate Agent, set up a meeting with Ely and within 3 weeks I had closed the sale on a townhouse in Cleveland. They took position. Ely's negotiating skills were amazing and the purchase price was well below the asking price - about $40k. Ely also smoothed out the bumps along the way to settlement day and believe me there were a few!! I am extremely happy with the service I received and my new home! Thanks Ely",
      "highlights": ["Cleveland townhouse", "$40k below asking", "3 weeks", "Negotiation service"]
    },
    {
      "id": 21,
      "reviewer": "Nicholas McCluskey",
      "rating": 5,
      "date": "9 months ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Multiple Properties",
      "text": "Always a great experience working with Ely and his team. Market knowledge is second to none with a highly efficient process in place to ensure no stone is left unturned in his search, as a result, Ely has purchased several properties through me off and on market for his clients. As an agent I deal with different buyers agents everyday so I can confidently say Ely is one of the best I have worked with. Looking forward to working together again soon!",
      "highlights": ["Off-market access", "Multiple purchases", "Agent testimonial"]
    },
    {
      "id": 22,
      "reviewer": "Alison Anderson",
      "rating": 5,
      "date": "a year ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Interstate",
      "property_type": "Investment Property",
      "text": "We can't thank Jake and his team enough for the wonderful service provided with buying our investment property. Living interstate proved difficult to find a property that suited our needs, but after several months of frustration and time wasting , we contacted Jake and his team. Within days we had multiple properties to look at and found what we were looking for within a few weeks . The communication was brilliant throughout the whole purchase and was well worth using a buyers agent to eliminate time, stress and inspections .This helped us make informed decisions and nothing was ever too much trouble.\n\nThank you Jake and team , we will certainly use your services for our next purchase and will recommend you to friends and family . We would still be looking for a property if it wasn't for you !",
      "highlights": ["Interstate investor", "Within weeks", "Multiple options"]
    },
    {
      "id": 23,
      "reviewer": "Team Drift",
      "rating": 5,
      "date": "10 months ago",
      "agent": "Jake Edwards, Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Gold Coast",
      "property_type": "Commercial Property",
      "text": "Always a great time with Jake, Ely and the team! \"They helped us secure the perfect commercial property for our growing business. It was an easy and enjoyable experience. Highly recommend!\"",
      "highlights": ["Commercial property", "Gold Coast", "Business purchase"]
    },
    {
      "id": 24,
      "reviewer": "Veronica Cook",
      "rating": 5,
      "date": "a year ago",
      "agent": "Ely Smith, Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Home",
      "text": "From the moment I met Ely and Emma there was a connection. I was searching for a property on my own but when having endless grief with agents not returning calls or communicating...perhaps because the market is so active they didn't need me!\n\nEly and Emma took all that grief away. After providing a brief on what we wanted, they swiftly moved into action. A property was located quickly, best of all at a price I couldn't have negotiated myself with agents, competing with the queues of people viewing similar homes. I believe we potentially saved $40k to $50k off market purchase price using Ely and Emma's services.\n\nTo give Emma took the pain out of the experience. Time is valuable for me being a busy working mum running my own business and using the services of Edwards & Smith Buyers Agents without a doubt took away the world of hurt dealing with Real Estate agents.\n\nThe continued arrangements of ESP and any other property access requirements were all handled by Ely and Emma, so I didn't have to locate these other services. They handled all the steps from finding property to settlement.\n\nThe professionalism, integrity and communication displayed during the process was awesome... I was always kept updated. I wasn't chasing, which was refreshing.",
      "highlights": ["$40-50k savings", "Busy working mum", "Full service"]
    },
    {
      "id": 25,
      "reviewer": "Juliana Gomes",
      "rating": 5,
      "date": "9 months ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Unknown",
      "text": "Jake from Edward & Smith Buyers Agent is excellent! His deep market knowledge, proactive approach, and genuine care for his client set him apart. He consistently goes above and beyond to find the perfect property, making the entire buying process stress-free. Highly recommend!",
      "highlights": ["Market knowledge", "Proactive", "Stress-free"]
    },
    {
      "id": 26,
      "reviewer": "Leesa Potter",
      "rating": 5,
      "date": "a year ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Unknown",
      "text": "This was our first time engaging a Buyers Agent and Ely's professional negotiating skills delivered an excellent result within weeks which was outstanding considering the current market conditions and limited available stock. We would highly recommend Edwards & Smith Buyers Agents. Ely was amazing throughout the entire process.",
      "highlights": ["First-time using agent", "Within weeks", "Limited stock market"]
    },
    {
      "id": 27,
      "reviewer": "Jason Millard",
      "rating": 5,
      "date": "a year ago",
      "agent": "Jake Edwards",
      "service": "Auction Representation",
      "location": "Unknown",
      "property_type": "Home",
      "text": "Jake and Jess were very professional and didn't give up until our new home was found.\n\nOur new house meets everything that we communicated in our briefing!\n\nI know for sure we wouldn't have secured our home at auction without them.\n\nHighly recommend",
      "highlights": ["Auction success", "Persistent", "Met all criteria"]
    },
    {
      "id": 28,
      "reviewer": "Trent Hones",
      "rating": 5,
      "date": "a year ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Off-Market",
      "text": "I have dealt with Jake and Jess on 2 occasions where I was the selling agent. Both times they have been able to secure a property off market for their clients effectively removing any competition from other buyers. They are extremely efficient and quick in responding to any issue that may occur. They represent their clients well and I have no issue in recommending them to any potential buyer I come across",
      "highlights": ["Off-market", "Agent testimonial", "Efficient"]
    },
    {
      "id": 29,
      "reviewer": "Obi-Wan Kenobi",
      "rating": 5,
      "date": "5 months ago",
      "agent": "Unknown",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Investment Property",
      "text": "My partner Savannah and I chose to go with Edwards and Smith. We were not disappointed he and his team were amazing. We had no experience and they made us purchasing our first investment property a breeze would highly recommend!",
      "highlights": ["First investment", "No experience", "Easy process"]
    },
    {
      "id": 30,
      "reviewer": "david gleig",
      "rating": 5,
      "date": "a year ago",
      "agent": "Jake Edwards, Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Queensland",
      "property_type": "Investment Properties",
      "text": "After getting a reference from a friend who had a great success story working with Jake Edwards, I needed a buyers agent to help buy an investment property in QLD. 12months on and we have completed two home purchases with Jake, Ely and ...",
      "highlights": ["Two purchases", "Investment", "Referral"]
    },
    {
      "id": 31,
      "reviewer": "Dylan Pappalardo",
      "rating": 5,
      "date": "10 months ago",
      "agent": "Jake Edwards, Emma Handley",
      "service": "Full Buyers Agent Service",
      "location": "Gold Coast/Brisbane",
      "property_type": "Unknown",
      "text": "Jake & Emma have supported my clients since we met and have always gone above and beyond. They understand the current market, trends and always deliver a solution. I wouldn't be seen using anyone else in Gold Coast/Brisbane. These guys get the job done.",
      "highlights": ["Industry professional", "Market trends", "Gold Coast/Brisbane"]
    },
    {
      "id": 32,
      "reviewer": "Casey Noble",
      "rating": 5,
      "date": "2 years ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Interstate",
      "property_type": "Investment Property",
      "text": "I can't recommend Edwards & Smith enough. Jake just helped us secure our first investment property. We bought interstate & Jake took care of everything from going to inspections, communicating with agents & organising everything for us. Something that seemed like a very daunting task was honestly a breeze with his help. We will definitely be going to him again when we buy next!",
      "highlights": ["Interstate", "First investment", "Full service"]
    },
    {
      "id": 33,
      "reviewer": "Natalie D'souza",
      "rating": 5,
      "date": "2 years ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Home",
      "text": "Jake helped us find our new home in Brisbane to help us relocate from interstate. We love our new home which he found for us within a month and within our budget. He is easy to work with and very thorough. Would 100% recommend Edwards and Smith buyers agent.",
      "highlights": ["Brisbane relocation", "Within month", "Within budget"]
    },
    {
      "id": 34,
      "reviewer": "Nick Skibinski",
      "rating": 5,
      "date": "a year ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Home",
      "text": "Thanks to Ely I secured an amazing property.\n\nEly was effective in understanding my property needs. He attended open inspections, researched the properties and spoke to agents on my behalf.\n\nHe directly negotiated with the agents and kept me in the loop and also coordinated with my loan broker.\n\nI am very satisfied with Ely's service and knowledge. I would not be moving into my new home without his assistance.",
      "highlights": ["Negotiation", "Broker coordination", "Full support"]
    },
    {
      "id": 35,
      "reviewer": "Shaun G",
      "rating": 5,
      "date": "a year ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Family Home",
      "text": "Jake & Jess made our purchasing process a delight. From the very start they nailed our brief and understood our needs to find the perfect family home. Jake & Jess sent through numerous properties both on the market and off market opportunities. After finding the right property they swiftly secured the in demand property with multiple interested buyers. Couldn't be happier",
      "highlights": ["Off-market access", "Multiple buyers", "Swift action"]
    },
    {
      "id": 36,
      "reviewer": "Javaria Mofazzal",
      "rating": 5,
      "date": "a year ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "House",
      "text": "Ely helped me in every single step of helping me buy my house. As I am very busy , he send me videos of all the properties he visited for me. Even went a step further in helping me find building and pest inspector. He was very reliable and contactable. I would recommend him to anyone and for sure will use his services again.",
      "highlights": ["Video inspections", "Busy professional", "Building/pest coordination"]
    },
    {
      "id": 37,
      "reviewer": "Natasha Pizzica",
      "rating": 5,
      "date": "2 years ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Home/Investment",
      "text": "Jake is an incredibly well connected buyers agent. He is personal and goes above and beyond for his clients. He is an effective communicator who was honest and open during the whole house buying process. I would highly recommend Jake if you're looking to buy your next home with ease, whether that be to reside in or as an investment property.",
      "highlights": ["Well connected", "Honest communication", "Versatile"]
    },
    {
      "id": 38,
      "reviewer": "Alex Smith",
      "rating": 5,
      "date": "2 years ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Dream Property",
      "text": "Jake is the absolute best! He helped us secure our dream property and goes above and beyond with his services. Will be recommending him and the rest of his team to all of my friends and family looking to purchase.",
      "highlights": ["Dream property", "Above and beyond", "Referrals"]
    },
    {
      "id": 39,
      "reviewer": "Sam Skinner",
      "rating": 5,
      "date": "a year ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "First Home",
      "text": "Ely helped my wife and I buy our first home. The process was made so easy through the help of Ely and we were able to find exactly what we were looking for, for a price we wouldn't have been able to get by ourselves. So grateful for Ely's help and would highly recommend Edwards and Smith Buyers Agents to anyone looking to get into the market!",
      "highlights": ["First home", "Better price", "Easy process"]
    },
    {
      "id": 40,
      "reviewer": "tamara henman",
      "rating": 5,
      "date": "10 months ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Unknown",
      "text": "Jake and his team are knowledgeable, diligent and professional. They work tirelessly for clients and are great to collaborate with to achieve great outcomes!",
      "highlights": ["Knowledgeable", "Diligent", "Collaborative"]
    },
    {
      "id": 41,
      "reviewer": "GJ Cast",
      "rating": 5,
      "date": "9 months ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Investment",
      "text": "Jake and his team make buying really easy and effective. Jake found several good quality options for us and advised knowledgeably towards the best.",
      "highlights": ["Multiple options", "Knowledgeable advice", "Investment"]
    },
    {
      "id": 42,
      "reviewer": "Brooke Edwards",
      "rating": 5,
      "date": "a year ago",
      "agent": "Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Gold Coast",
      "property_type": "Unknown",
      "text": "Thank you Jake & Jess for all our help and guidance over the past month or so. You helped us navigate the crazy market on the Gold Coast and presented some off market properties. We are truly grateful. I highly recommend the team at Edwards & Smith.",
      "highlights": ["Gold Coast market", "Off-market", "Market navigation"]
    },
    {
      "id": 43,
      "reviewer": "jett smith",
      "rating": 5,
      "date": "a year ago",
      "agent": "Ely Smith, Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Unknown",
      "text": "Ely and Jake were super professional from start to finish. Highly recommend using these guys if you're looking to purchase some property!",
      "highlights": ["Professional", "Team collaboration"]
    },
    {
      "id": 44,
      "reviewer": "Deb Dakin",
      "rating": 5,
      "date": "11 months ago",
      "agent": "Ely Smith",
      "service": "Full Buyers Agent Service",
      "location": "Brisbane",
      "property_type": "Unknown",
      "text": "A very worthwhile investment when we engaged Ely to assist us. Would recommend Edwards & Smith without hesitation.",
      "highlights": ["Worthwhile investment", "No hesitation"]
    },
    {
      "id": 45,
      "reviewer": "Morgan Tendercrisp",
      "rating": 5,
      "date": "5 months ago",
      "agent": "Emma Handley, Ely Smith, Jake Edwards",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Unknown",
      "text": "The Team at Edwards & Smith are a pleasure to deal with. Emma, Ely and Jake have been nothing short of amazing.",
      "highlights": ["Team excellence", "Pleasure to work with"]
    },
    {
      "id": 46,
      "reviewer": "peter divers",
      "rating": 5,
      "date": "a year ago",
      "agent": "Unknown",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "House",
      "text": "These guys were amazing helping us every step of the way from finding a property to negotiating and finally walking us through step by step the paperwork and logistics of buying the house. You will certainly save in time and money the cost they charge.",
      "highlights": ["Every step support", "Time and money saved", "Paperwork help"]
    },
    {
      "id": 47,
      "reviewer": "Sam Flanders",
      "rating": 5,
      "date": "a year ago",
      "agent": "Unknown",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Home",
      "text": "Couldn't be happier with the experience I've had, would highly recommend! worked tirelessly to find the right home and were very patient through the process. 👍",
      "highlights": ["Tireless work", "Patient", "Right home found"]
    },
    {
      "id": 48,
      "reviewer": "Tim Aquino",
      "rating": 5,
      "date": "10 months ago",
      "agent": "Unknown",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Unknown",
      "text": "Awesome team, can't wait to work with you guys again!",
      "highlights": ["Repeat customer", "Awesome team"]
    },
    {
      "id": 49,
      "reviewer": "Jonathan Munck",
      "rating": 5,
      "date": "a year ago",
      "agent": "Unknown",
      "service": "Full Buyers Agent Service",
      "location": "Unknown",
      "property_type": "Unknown",
      "text": "Referred a number of clients. Great outcomes. Keep up the good work.",
      "highlights": ["Multiple referrals", "Great outcomes", "Industry professional"]
    }
  ],
  "summary": {
    "total_reviews": 49,
    "average_rating": 5.0,
    "agents_mentioned": {
      "Jake Edwards": 23,
      "Ely Smith": 18,
      "Emma Handley": 14,
      "Kath Mackay": 2,
      "Dylan Adkins": 1,
      "Mackenzie": 1
    },
    "services": {
      "Full Buyers Agent Service": 46,
      "Property Evaluation & Negotiation": 1,
      "Auction Representation": 1
    },
    "locations_identified": {
      "Brisbane": 20,
      "Gold Coast": 5,
      "Cleveland": 1,
      "Interstate": 5,
      "Unknown": 18
    },
    "common_highlights": {
      "Under budget / savings": 12,
      "Fast timeline (weeks)": 10,
      "First-time buyers": 8,
      "Interstate buyers": 5,
      "Off-market access": 5,
      "Stress-free process": 15,
      "Great communication": 18
    }
  }
}
